<?php

require_once 'common.php';
ob_start();
?>
<!DOCTYPE html>
<meta charset="utf-8">
<title>隐私政策-好游快爆</title>
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0">
<meta name="apple-mobile-web-app-capable" content="yes">
<meta name="apple-mobile-web-app-status-bar-style" content="black">
<meta name="format-detection" content="telephone=no">
<link href="<?=$path?>css/instyle_e1.css" type="text/css" rel="stylesheet">
<link rel="canonical" href="http://www.3839.com/about.html">
<script>
    setfontsize();
    window.onresize=function(){setfontsize()};
    function setfontsize(){
        var deviceWidth = document.documentElement.clientWidth;
        if(deviceWidth > 750){
            deviceWidth = 750;
        }
        document.documentElement.style.fontSize = (deviceWidth / 7.5).toFixed(2) + "px";
    }
</script>


<div class="dlarea">
   <a href="https://m.3839.com/"><div class="dllogo">好游快爆</div></a>
    <div class="fixbtn">
        <script>
            var ua = navigator.userAgent;
            var ua_info = {
                android:ua.match(/(Android)\s+([\d.]+)/i),
                ios:ua.match(/iphone|ipad|ipod/i)
            };
            if (ua_info['android']) {
                document.write('<a class="btn btn-az" href="http://d.4399.cn/Cj">立即下载</a>');
            }
        </script>
    </div>
</div>


<div class="area">
    <div class="areatit">隐私政策</div>
    <div class="areabd">
        <p style="text-indent:0em;">
            <font color="#999999"><font color="#ff0000" size="3"><strong>序言<br /></strong></font>好游快爆(以下简称“快爆”或“本款产品”)是对于手机设备管理及手机内容资源下载工具，包含手机软件的浏览和下载。好游快爆由厦门纯游互动科技有限公司(以下简称“纯游互动”)提供。非常感谢您对好游快爆的信任。好游快爆保证公司各产品(或服务)在使用您的个人信息的时候遵循“四不三必须”的七个规范，即：
                <br />一.不该看的不看。
                <br />二.不该传的不传。
                <br />三.不该存的不存。
                <br />四.不该用的不用。
                <br />五.一切行为必须明示，尊重用户的知情权和选择权。
                <br />六.必须经过用户许可。
                <br />七.必须对收集的用户隐私信息负责。
                <br />本隐私政策将帮助您了解以下内容：
                <br />一.我们如何收集和使用您的个人信息
                <br />二.我们如何存储您的个人信息
                <br />三.我们如何共享、转让、公开披露您的个人信息
                <br />四.我们如何保护您的个人信息
                <br />五.您管理个人信息的权利
                <br />六.未成年人个人信息保护
                <br />七.隐私政策的适用范围
                <br />八.隐私政策的变更和修订
                <br />九.如何联系我们
                <br />十.隐私政策的生效
                <br />我们希望通过本隐私政策向您说明，在使用好游快爆时，我们如何收集、使用、存储、分享和转让您的个人信息，以及我们为您提供的访问、更新、删除和保护这些信息的方式。请在使用好游快爆前，务必仔细阅读并了解本隐私政策，在确认充分理解并同意后使用我们的产品或服务。一旦您开始使用好游快爆，即表示您已充分理解并同意本政策，并同意我们按照本隐私政策收集、使用、储存和分享您的相关信息。如对本政策内容有任何疑问、意见或建议，您可通过本隐私政策提供的各种联系方式与我们联系。
                <br />
                <br /><font color="#000000" size="3">一、我们如何收集和使用您的个人信息<br /></font>(一)实现好游快爆的基本功能
                <br />1、手机管理和内容资源下载功能。为实现手机管理及手机内容资源下载的基本功能，好游快爆会通过手机系统的公用接口收集经过MD5算法加密的国际移动设备身份码(IMEI)和网络设备地址(MAC)，以及手机型号、手机系统版本号、系统编号、系统ID号、屏幕分辨率、上网类型、手机中软件的名称、版本号、版本名、包名、软件使用时间和频率、软件崩溃信息等与设备和软件相关的信息。这些信息是提供服务所必须收集的基础信息。
                <br />2、软件升级管理功能。为实现手机软件下载、安装、升级、卸载等软件管理功能，在您使用好游快爆时，我们会采集您手机中已安装软件的软件名称、版本号、版本名、软件包名信息并上传到我们的服务器进行软件版本比对。如果经比对发现有更新的版本，好游快爆会提示您升级相应的软件。上述软件信息为实现这些功能所必需，不涉及您个人身份等敏感信息，也不包括您使用这些软件所产生的任何相关数据(例如软件的存档、文档、图片等)，好游快爆亦不会采集、上传或存储此类数据，或将其与您的其他任何个人信息进行匹配。
                <br />3、过滤无法使用的软件功能。为了过滤您手机无法使用的软件，好游快爆会收集您手机的系统版本号、屏幕分辨率等信息，并依据这些信息排除您手机无法使用的软件，以保证您在好游快爆下载的软件都可安装使用。
                <br />(二)通过注册账号、登录或提供信息，与我们交流并享受更加个性化的服务
                <br />1、通过注册账号收集的信息。当您注册快爆账号时，好游快爆会收集您的手机号码、用户名，收集这些信息是为了帮助您完成快爆账号注册，保护您的账号安全。如果您拒绝提供这些信息，您可能无法正常注册快爆账号，亦无法享受我们提供的基于账号的个性化服务和推荐，但不影响您使用本款产品的其他功能。 在您注册好游快爆账号的过程中，您可以向我们提供您的性别、生日、爱好、婚姻状况、教育程度、职业、毕业院校、收入水平等信息，这些信息有助于我们向您提供更加个性化的服务和推荐，但拒绝提供这些信息不影响您使用本款产品的其他功能。您亦可以通过“好游快爆APP->我的->个人主页->修改资料”界面更改这些信息。
                <br />2、间接收集的信息。为方便您登录快爆账号，您可以通过微博、QQ、微信等第三方账号登陆本款产品及快爆的其他产品和服务。为实现前述目的，我们可能需要从第三方获取并收集您的第三方账号信息，如昵称、头像。除上述情况外，目前快爆不会主动从第三方获取您的个人信息，如果未来业务发展需要从第三方间接获取您的个人信息，我们会在获取前向您明示个人信息的来源、类型及使用范围。如果好游快爆开展业务需要进行的个人信息处理活动超出了您向第三方授权同意的处理范围，我们将在处理您的个人信息前征得您的明示同意。我们亦将严格遵守相关法律规定，要求第三方保障其提供的信息的合法性。
                <br />3、论坛反馈。好游快爆论坛是一个用户分享、交流、活动互动的平台。任何用户都可以通过登陆好游快爆用户中心登陆好游快爆论坛进行发帖、回帖操作。根据国家相关法律规定，当您登陆好游快爆论坛进行发帖和回帖操作时，好游快爆需要您提供手机号码并与好游快爆账号绑定进行身份认证，否则您将无法使用发帖、回帖等功能。但如您拒绝进行身份认证，您仍然可以浏览好游快爆论坛。
                <br />(三)改善我们的产品和服务
                <br />1、用户体验改进计划。我们可能会收集经过MD5算法加密的国际移动设备身份码(IMEI)和网络设备地址(MAC)，以及手机型号、手机系统版本号、系统编号、系统ID号、屏幕分辨率、上网类型、手机中软件的名称、版本号、包名、软件使用时间和频率、软件崩溃日志等，用于统计我们产品的用户数量、分析产品的使用状况、排查崩溃原因、减少崩溃情况，以不断改进我们的产品。这些信息不涉及到您的个人身份等隐私信息。
                <br />2、解决您反馈的问题。您可以通过本款产品向我们反馈您使用本款产品中遇到的问题。如果您没有注册我们的账号，您需要向我们提交您的手机号码、邮箱或QQ号码以便我们能联系您并对您反馈的问题进行解答。如果您注册了我们的账号，您亦可以通过登录用户中心向我们反馈问题。我们会通过分析前段中提到的信息找出问题原因并努力解决问题。您在反馈意见中所提供的联系方式，只会用于我们的客服与您沟通与反馈，除征得用户明确同意和法律明确规定外，好游快爆公司不会向任何第三方提供您提供的联系信息。
                <br />(四)安全保障
                <br />为提高您使用我们及我们关联公司、合作伙伴提供服务的安全性，保护您或其他用户或公众的人身财产安全免遭侵害，更好地预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等安全风险，更准确地识别违反法律法规或好游快爆相关协议规则的情况。我们可能使用或整合您的账户信息、设备信息、软件使用信息以及我们关联公司、合作伙伴取得您授权或依据法律共享的信息，用于进行身份验证、检测及防范安全事件，并依法采取必要的记录、审计、分析、处置措施。
                <br />(五)其他用途
                <br /><font color="#000000" size="3"><strong>您了解并同意，</strong></font>在符合法律法规的前提下，我们可能会将您的个人信息在匿名化、汇总、脱敏和加密处理后，形成统计信息或用户画像(但画像无法识别任何用户个人)，为您展示和推送相关服务、产品或功能。如果我们将信息用于本政策未载明的其他用途，或者将基于特定目的收集而来的信息用于其他目的，我们会事先征求您的同意。
                <br />(六)征得授权同意的例外
                <br />根据相关法律法规规定，以下情形中收集您的个人信息无需征得您的授权同意：
                <br />1.与国家安全、国防安全有关的;
                <br />2.与公共安全、公共卫生、重大公共利益有关的;
                <br />3.与犯罪侦查、起诉、审判和判决执行等有关的;
                <br />4.出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的;
                <br />5.所收集的个人信息是您自行向社会公众公开的;
                <br />6.从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道;
                <br />7.根据您的要求签订合同所必需的;
                <br />8.用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障;
                <br />9.为合法的新闻报道所必需的;
                <br />10.学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的;
                <br />11.法律法规规定的其他情形。
                <br />
                <br /><font color="#000000" size="3">二、我们如何存储您的个人信息<br /></font>我们在中华人民共和国境内收集和产生的个人信息将存储在中华人民共和国境内。
                <br />2.2 您注册成功后，纯游互动公司将为您基于好游快爆服务使用的客观需要开通好游快爆服务。您所申请注册成功的好游快爆帐号与密码由您自身保管，您在使用好游快爆服务过程中，须对自身使用好游快爆服务的行为，对任何您通过好游快爆服务发布、公开的信息，及由此产生的任何后果承担全部责任。
                <br />若为处理跨境业务，确需向境外机构传输境内收集的相关个人信息的，我们会按照法律、行政法规和相关监管部门的规定执行。我们会确保您的个人信息得到足够的保护，例如匿名化、加密存储等。
                <br />我们仅在本政策所属目的的所必须期间和法律法规要求的时限内存储您的个人信息。
                <br />如我们停止运营好游快爆的产品或服务，我们将及时停止继续收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，并对我们存储的个人信息进行删除或匿名化处理。
                <br />
                <br /><font color="#000000" size="3">三、我们如何共享、转让、公开披露您的个人信息<br /></font>(一)共享
                <br />我们不会与任何公司、组织和个人共享您的个人信息，但以下情况除外：
                <br />1.我们可能会根据法律法规规定、诉讼争议解决需要，或按行政、司法机关依法提出的要求，对外共享您的个人信息。
                <br />2.在获取您明确同意的情况下，我们会与其他方共享您的个人信息。
                <br />3.在我们的关联方向您或向我们提供服务的情况下，我们可能与我们的关联公司共享您的个人信息。但我们仅共享必要的个人信息，且关联方对您信息的处理受本隐私政策的约束。关联公司如要改变您个人信息的处理目的，将再次征求您的授权和同意。
                <br /><font color="#000000" size="3"><strong>4.您了解并同意，仅为实现本隐私政策中声明的目的，我们可能会与我们的供应商、服务提供商、顾问或代理人共享您的个人信息，以提供更好的客户服务和用户体验。这些供应商、服务提供商、顾问、代理人可能为我们提供技术基础设施服务，分析我们服务的使用方式，衡量广告和服务的有效性，提供客户服务和支付服务，进行学术研究和调查，或提供法律、财务与技术顾问服务。</strong></font>
                <br />对我们与之共享个人信息的公司、组织和个人，我们会要求其按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息。</font>
        </p>
        <p style="text-indent:0em;"><font color="#999999">我们不会将您的个人信息转让给其他任何公司、组织和个人，但以下情形除外<br />1.随着纯游互动公司业务的发展，我们及我们的关联公司有可能进行合并、收购、资产转让或其他类似的交易。如相关交易涉及到您的个人信息转让，我们会要求新持有您个人信息的公司、组织和个人继续受此政策约束，否则我们将要求该公司、组织和个人重新征得您的授权同意。<br />在获得您明确同意的情形下转让，亦即获得您明确同意后，我们会向其他方转让我们已经获取的您的个人信息。<br />(三)披露<br />我们仅会在以下情况下，公开披露您的个人信息：<br />1.已经获得您明确同意。<br />2.在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。<br />3.法律法规规定的其他情形。<br /> <br /><font color="#000000" size="3">四、我们如何保护您的个人信息<br /></font>我们已采取符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。
                <br />1.我们会对可识别的个人身份信息进行加密传输和存储，以确保数据的保密性。对于您手机设备标识符国际移动设备身份码(IMEI)、网络设备地址(MAC)，我们在您的设备端会用MD5算法进行匿名化和加密，并仅收集和上传经过匿名化和加密后的标识符。
                <br />2.如果用户注册了好游快爆账号，我们可能通过对好游快爆用户的登录时间、IP、登录次数等信息进行分析，妥善做好风控管理。如有疑似非本人登录操作的情况，我们将通过短信提醒用户，避免好游快爆账户被非本人登录操作。对于您使用的手机与我们客户端之间的数据交换，我们采用了我们自定义的加密方案和https双重加密的方式进行传输，以确保数据传输的安全性。
                <br />3.若我们的应用采用了WebView技术，我们会对在WebView中使用的所有file协议进行URL校验且限制访问本应用敏感数据以及SDCard数据，避免在无特殊权限的情况下好游快爆产品的任意私有文件和敏感信息被恶意盗用，从而造成您的个人信息被泄露。
                <br />4.我们在服务端部署访问控制机制，对可能接触到您个人信息的工作人员采取最小够用授权原则，并定期核查访问人员名单和访问记录。
                <br />5.我们存储用户个人信息的服务器系统均为安全加固后的操作系统。我们会对服务器操作进行账户审计及监控。如果发现外部公告有安全问题的服务器操作系统，好游快爆会在第一时间会进行服务器安全升级，确保好游快爆所有服务器系统及应用安全。
                <br />6.我们为工作人员定期举办个人信息保护相关法律法规培训，以加强工作人员的用户个人隐私保护意识。
                <br />7.如果不幸发生我们的物理、技术或管理防护措施遭到破坏的事件，我们会及时启动应急预案，防止安全事件扩大，按照法律法规的要求上报国家主管机关，并及时采取推送、公告等合理、有效的方式向您告知安全事件的基本情况、可能的影响、已经采取的措施或将要采取的措施等。
                <br />
                <br /><font color="#000000" size="3">五、您管理个人信息的权利<br /></font>在您使用好游快爆期间，您可以通过以下方式访问并管理您的个人信息：
                <br />(一)访问和更正您的个人信息
                <br />您可以通过好游快爆官网登录 好游快爆用户中心查询和更正您的好游快爆账户信息以及您提供的信息，包括密码、性别、年龄、生日、爱好、婚姻状况等信息。
                <br />(二)删除您的个人信息
                <br />以下情况发生时，您有权要求好游快爆公司删除您的个人信息：
                <br />1.我们没有征求您的明确同意，收集了您的个人信息。
                <br />2.我们处理您的个人信息违反了法律法规要求。
                <br />3.我们违反了与您的约定来使用和处理您的个人信息。
                <br />4.您注销了好游快爆账号、卸载或者不再使用我们的产品(或服务)。
                <br />5.我们停止对您提供服务。
                <br />您可以通过本隐私政策第九节提供的方式联系我们要求删除您的个人信息，我们会在15个工作日内给予答复。当我们从服务器中删除您的个人信息后，我们可能不会立即从备份系统中删除相应的数据，但会在备份更新的时候删除这些信息。
                <br />(三)注销您的个人账户
                <br />您可以登录好游快爆用户中心随时注销您的好游快爆账户。请您注意，如果您选择注销好游快爆账户，那么您的好游快爆账号将不可被使用且相关账号信息将被删除，您将无法再通过好游快爆账号登录好游快爆的服务(但不会影响您使用无需账号登录即可使用的服务和功能)。
                <br />当您注销账户后，除法律法规要求我们保存相关信息的情况外，我们将停止为您提供相应的产品(或服务)，并在10个工作日内删除或匿名化您的个人信息。
                <br />(四)撤回您的同意或授权
                <br />您可以通过关闭设备功能而撤回对您个人信息收集和使用的同意。对于本款产品而言，您可以通过手机的设置功能关闭对我们收集您的GPS位置信息的权限。
                <br />请您理解，每项业务功能需要一些基本的个人信息才能得以完成(见本隐私政策第一节)，当您撤回同意或授权后，我们无法继续为您提供撤回同意或授权所对应的服务，也将不再处理相应的个人信息。但您撤回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。</font>
        </p>
        <p><font color="#999999"><br /><font color="#000000" size="3">六、未成年人个人信息保护<br /></font>未成年人在使用好游快爆产品(或服务)时，需要监护人同意和授权。我们建议未成年父母或监护人为其阅读本隐私政策，并建议未成年人在提交个人信息之前寻求父母或监护人的同意和指导。若您是未成年人的监护人，当您对您所监护的未成年人的个人信息有疑问时，您可以通过本隐私政策第九节的联系方式与我们联系。
                <br />
                <br /><font color="#000000" size="3">七、隐私政策的适用范围<br /></font>本隐私政策仅适用于好游快爆。好游快爆的其他产品和服务将使用相关产品或服务的隐私政策。特别需要说明的是，本隐私政策不适用以下情况：
                <br />1. 将好游快爆产品(或服务)嵌入到第三方产品(或服务)，第三方产品(或服务)收集的信息。
                <br />2. 在好游快爆产品(或服务)中接入的第三方服务、广告或其他公司、组织或个人所收集的信息。
                <br />
                <br /><font color="#000000" size="3">八、隐私政策的变更和修订<br /></font>我们的隐私政策可能变更。未经您明确同意，我们不会限制您按照本隐私政策所应享有的权利。
                <br />对于本隐私政策的重大变更，我们还会提供显著的通知（例如，在软件改版或升级、或您重新登录时，对您进行及时通知）。
                <br />本政策所指的重大变更包括但不限于：
                <br />1.我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等;
                <br />2.我们在控制权等方面发生重大变化。如并购重组等引起的所有者变更等;
                <br />3.个人信息共享、转让或公开披露的主要对象发生变化;
                <br />4.您参与个人信息处理方面的权利及其行使方式发生重大变化;
                <br />5.我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时;
                <br />6.个人信息安全影响评估报告表明存在高风险时。
                <br />在本条情况下，若您继续使用我们的服务，即表示同意受经修订的本《隐私政策》的约束。
                <br />
                <br /><font color="#000000" size="3">九、如何联系我们<br /></font>如果您对我们的隐私政策及对您个人信息的处理有任何疑问、意见、建议或投诉，请通过以下方式与我们联系
                <br />联系邮箱：</font><font color="#999999">haoyoukuaibao@qq.com</font>
            <br /><font color="#999999">在一般情况下，我们会在15个工作日内对您的请求予以答复。</font>
        </p>
	</div>
</div>

<script type="text/javascript" src="<?=$path?>js/footer_wap.js"></script>
<script type="text/javascript" src="http://newsimg.5054399.com/js/mtj.js"></script>
<?php
$html = ob_get_contents();
ob_clean();

$html = convertHttps($html);
echo $html;

$sc = intval($_GET['sc']);

if ( $sc == 1 ) {
    $str = ob_get_contents();
    ob_clean();
    if (strlen($str) > 500) {
        header('content-type:text/html;charset=utf-8');
        $path = $_SERVER['DOCUMENT_ROOT'] . '/policy.html';

        $dir  = dirname($path);

        if (!is_dir($dir) || (!is_file($path) && !is_writable($dir)) || (is_file($path) && !is_writable($path))) {
            die('<font color="red">请联系技术，文件没有写入权限</font>');
        }

        file_put_contents($path,$str);
        echo '<a href="/policy.html">生成成功</a>';
    }
}

?>

